//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//TSOBATCH EXEC PGM=IKJEFT01
//STEPLIB  DD DISP=SHR,DSN=SYS1.CBT.LINKLIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
PDS 'CBT.CBT502.FILE888.PDS'
MATCH 'CBT.V503.FILE888.PDS' DATA SAMLIST
PDS 'SBGOLOB.CBT502.FILE999'
MATCH 'CBT.V503.FILE999.PDS' DATA SAMLIST
